Revit 2027 API
IFCLegacyStairOrRamp.IsRamp Property
 True if it is a ramp, false if it is a stair.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRamp { get; }
Public ReadOnly Property IsRamp As Boolean
	Get
public:
property bool IsRamp {
	bool get ();
}
member IsRamp : bool with get
Property Value
Boolean
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace